# C++ Common Libraries
brew "abseil"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Cross-platform make
brew "cmake"
# Command-line interface for SQLite
brew "sqlite"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google AI models from the command-line
brew "antigravity-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Command-driven, interactive function plotting
brew "gnuplot"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Next-gen compiler infrastructure
brew "llvm"
# Backup your application settings and other important files to the cloud
brew "mackup"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Deep clean and optimize your Mac
brew "mole"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# AI agent toolkit
brew "pi-coding-agent"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Converts video, audio and images
cask "adapter"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application uninstaller
cask "appcleaner"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Design tool
cask "canva"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
# Tool to measure the computer system's performance
cask "geekbench"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Statistical analysis application
cask "jasp"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Document editor
cask "onlyoffice"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
# Collect, organise, cite, and share research sources
cask "zotero"
# Reaper is a complete digital audio production application for Windows and macOS
cask "reaper"
# VS Code extensions
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "atian25.copy-syntax"
vscode "brunnerh.insert-unicode"
vscode "chrischinchilla.vscode-pandoc"
vscode "csholmq.excel-to-markdown-table"
vscode "donjayamanne.githistory"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "humao.rest-client"
vscode "jeff-hykin.polacode-2019"
vscode "jock.svg"
vscode "marp-team.marp-vscode"
vscode "mdickin.markdown-shortcuts"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.hexeditor"
vscode "nhoizey.gremlins"
vscode "openai.chatgpt"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shuworks.vscode-table-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "stxr.iconfont-preview"
vscode "yzhang.markdown-all-in-one"
