tap "f/textream"
brew "abseil"
brew "antidote"
brew "bat"
brew "btop"
brew "cmake"
brew "sqlite"
brew "docker-completion"
brew "eza"
brew "fastfetch"
brew "lame"
brew "x265"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "gnuplot"
brew "graphviz"
brew "htop"
brew "icu4c@76"
brew "imagemagick"
brew "k9s"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "llvm"
brew "marp-cli"
brew "minikube"
brew "mole"
brew "nano"
brew "neovim"
brew "nmap"
brew "pandoc"
brew "pandoc-crossref"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "python@3.9"
brew "qpdf"
brew "speedtest-cli"
brew "starship"
brew "thefuck"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wget"
brew "woff2"
brew "youtube-dl"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "adapter"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "basictex"
cask "browserosaurus"
cask "bruno"
cask "canva"
cask "claude-code"
cask "codex"
cask "db-browser-for-sqlite"
cask "drawio"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "geekbench"
cask "ghostty"
cask "handbrake-app"
cask "iina"
cask "inkscape"
cask "jasp"
cask "obsidian"
cask "ollama-app"
cask "onlyoffice"
cask "postman"
cask "raycast"
cask "rectangle"
cask "streamlabs"
cask "teamviewer"
cask "telegram"
cask "f/textream/textream"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "wezterm"
cask "zotero"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "atian25.copy-syntax"
vscode "bierner.emojisense"
vscode "brunnerh.insert-unicode"
vscode "chrischinchilla.vscode-pandoc"
vscode "continue.continue"
vscode "csholmq.excel-to-markdown-table"
vscode "damonsk.vscode-wardley-maps"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dunstontc.viml"
vscode "efanzh.graphviz-preview"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "funkyremi.vscode-google-translate"
vscode "george-alisson.html-preview-vscode"
vscode "google.colab"
vscode "google.geminicodeassist"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "jeff-hykin.polacode-2019"
vscode "jock.svg"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "mdickin.markdown-shortcuts"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-modernize"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-open-iterm2"
vscode "neuron.neuron-ipe"
vscode "nhoizey.gremlins"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "robocorp.robocorp-code"
vscode "shd0w.obsidianite-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shuworks.vscode-table-formatter"
vscode "stephanvs.dot"
vscode "streetsidesoftware.code-spell-checker"
vscode "stxr.iconfont-preview"
vscode "thekalinga.bootstrap4-vscode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
npm "nord"
