# Useful Oh My Zsh plugins without loading full Oh My Zsh
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/vscode
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/virtualenv

# fzf tab completions
Aloxaf/fzf-tab

# Better interactive shell
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

